### Processing Data

##### Using Human Resourses (HR) Tables in Live Oracle SQL

##### HR.EMPLOYEES

#### Reading Data from Database (i.e., storing the data in PL/SQL variables)
            DECLARE
                --Explicitly mentioning the data types
                emp_id varchar2(10);
                f_name varchar2(50);
                l_name varchar2(50);
            BEGIN
                select EMPLOYEE_ID, FIRST_NAME, LAST_NAME into emp_id, f_name, l_name
                from hr.EMPLOYEES
                where EMPLOYEE_ID = 100; 
                dbms_output.put_line('Employee ID : '||emp_id);
                dbms_output.put_line('First Name : '||f_name);
                dbms_output.put_line('Last Name : '||l_name);
            END;

            Result:
            Employee ID : 100
            First Name : Steven
            Last Name : King

#### %Type

            %type is used to declare the datatypes implicitly
            i.e, %type will assign the same datatype of a field in database to PL/SQL variables

            DECLARE
                -- Data type is implicitly copied from the database
                emp_id HR.EMPLOYEES.EMPLOYEE_ID%TYPE;
                f_name HR.EMPLOYEES.FIRST_NAME%TYPE;
                l_name HR.EMPLOYEES.LAST_NAME%TYPE;
            BEGIN
                select EMPLOYEE_ID, FIRST_NAME, LAST_NAME into emp_id, f_name, l_name
                from hr.EMPLOYEES
                where EMPLOYEE_ID = 102; 
                dbms_output.put_line('Employee ID : '||emp_id);
                dbms_output.put_line('First Name : '||f_name);
                dbms_output.put_line('Last Name : '||l_name);
            END;

            Result:
            Employee ID : 102
            First Name : Lex
            Last Name : Garcia

#### Inserting data into database

            DECLARE
                -- explicit mentioning of the datatype
                emp_id HR.EMPLOYEES.EMPLOYEE_ID%type := 200;
                f_name HR.EMPLOYEES.FIRST_NAME%type := 'Dora';
            BEGIN
                INSERT INTO HR.EMPLOYEES(EMPLOYEE_ID, FIRST_NAME)
                VALUES(emp_id, f_name);

                commit;

                dbms_output.put_line('Data Successfully Loaded');

            END;